Repository: diegobz/Localizer
Catalog: locale/*.po
Languages: it

source: Add
it: Aggiungi

source: Default
it: Predefinito

source: Delete
it: Elimina

source: Change
it: Cambia

source: To add a language select it and click the <tt>Add</tt> button.
it: Per aggiungere una lingua selezionala e premi il pulsante <tt>Aggiungi</tt>

source: To delete a language check it and click the <tt>Delete</tt> button. To change the default language select it and click the <tt>Change</tt> button.
it: Per eliminare una lingua selezionala e premi il pulsante <tt>Elimina</tt>.Per cambiare la lingua predefinita selezionala e premi il pulsante <tt>Cambia</tt>.

source: There aren't languages
it: Non ci sono lingue.

source: Name
it: Nome

source: Type
it: Tipo

source: Hide this language
it: Nascondi questa lingua

source: Show this language
it: Mostra questa lingua

source: Save changes
it: Salva i cambiamenti

source: To add a new property enter its name, select its type and click the <tt>Add</tt> button.
it: Per aggiungere una nuova proprietà immetti il suo nome, scegli il suo tipo e premi il pulsante <tt>Aggiungi</tt>.

source: There aren't properties.
it: Non ci sono proprietà.

source: This <tt>%s</tt> object needs to be upgraded
it: Questo oggetto <tt>%s</tt> ha bisogno di essere aggiornato.

source: Upgrade
it: Aggiorna

source: This object don't needs to be upgraded.
it: Questo oggetto non ha bisogno di essere aggiornato.

source: Add Local Content
it: Aggiungi un Local Content

source: Languages
it: Lingue

source: A Local Content object provides an storage for multilingual (and non multilingual) properties. It also helps to keep your content separated from the logic and the presentation.
it: Un oggetto Local Content permette la memorizzazione di proprietà multilingua (e non multilingua). Ti aiuta anche a tenere separato il contenuto dalla presentazione.

source: Add Local Folder
it: Aggiungi un Local Folder

source: Title
it: Titolo

source: A local folder is a generic solution to manage any kind of multingual objects, files, images, scripts, etc..
it: Un Local Folder è una soluzione generale per gestire qualsiasi tipo di oggetti multilingua, come file, immagini, script, ecc...

source: To delete an attribute check it and click the <tt>Delete</tt> button.
it: Per eliminare un attributo selezionalo e premi il pulsante <tt>Elimina</tt>.

source: There aren't attributes
it: Non ci sono attributi.

source: To add an attribute introduce its id and click the <tt>Add</tt> button.
it: Per aggiungere un attributo inserisci il suo id e premi il pulsante <tt>Aggiungi</tt>.

source: Add Localizer
it: Aggiungi Localizer

source: A Localizer object lets to customize the language negotiation policy. It lets to use cookies, the path or any other criteria to select the user prefered language.
it: Un oggetto Localizer ti permette di personalizzare la politica di negoziazione della lingua. Ti permette di usare i cookie, il cammino o qualsiasi altro criterio per scegliere la lingua preferita dall'utente.

source: Use locale folders
it: Usa i Local Folder

source: Locale folders are useful to store special multilingual objects like images and specific logic. If used the <tt>Localizer</tt> object will transparently add the right locale folder to the url. If you want to use locale folders check the checkbox, otherwise uncheck it, then click the <tt>Change</tt> button.
it: I Locale Folders sono utili per memorizzare oggetti speciali multilingua come immagini e logica specifica. Se si usa, l'oggetto Localizer aggiungerà in modo trasparente il locale folder giusto all'url. Se vuoi usare i locale folders seleziona la checkbox, altrimenti deselezionala, poi premi il pulsante <tt>Cambia</tt>.

source: This <tt>Localizer</tt> object needs to be upgraded.
it: Questo oggetto <tt>Localizer</tt> ha bisogno di essere aggiornato.

source: This <tt>Localizer</tt> object don't needs to be upgraded.
it: Questo oggetto <tt>Localizer</tt> non ha bisogno di essere aggiornato.

source: Add Message Catalog
it: Aggiungi un Message Catalog

source: A message catalog stores messages and its translations to different languages. It provides the <tt>gettext</tt> method to get the right translation for a given message. Message catalogs are useful to translate the application interfaces (labels, buttons, etc..).
it: Un catalogo di messaggi memorizza i messaggi e le sue traduzioni in lingue diverse. Fornisce il metodo <tt>gettext</tt> per ottenere la traduzione corretta per un certo messaggio. I cataloghi dei messaggi sono utili per tradurre l'interfacce delle applicazioni (etichette, pulsanti, ecc...).

source: File / Language
it: File / Lingua

source: Export
it: Esporta

source: Language
it: Importa

source: Import
it: Importa

source: You can export the messages and their translations to PO files. Check <tt>locale.pot</tt> to get only the messages, without their translations. Check any other option to get a PO file with the messages and their translations to the selected language. Then click the <tt>Export</tt> button.
it: Puoi esportare il messaggi e le loro traduzioni in file PO. Scegli <tt>locale.pot</tt> per ottenere solo i messaggi, senza le loro traduzioni. Scegli qualsiai altra opzione per ottenere un file PO con i messaggi e le loro traduzioni nella lingua scelta. Poi premi il pulsante <tt>Esporta</tt>

source: You can add new messages and translations importing a PO file. Enter the filename, select the language of the translations and click the <tt>Import</tt> button.
it: Puoi aggiungere nuovi messaggi e traduzioni importando un file PO. Immetti il nome del file, scegli la lingua delle traduzioni e premi il pulsante <tt>Importa</tt>.

source: Save
it: Salva

source: Only untranslated messages
it: Solo messaggi non tradotti

source: Filter
it: Filtro

source: Results %d-%d of %d
it: Risultato %d-%d di %d

source: There aren't messages.
it: Non ci sono messaggi

source: Your name
it: Il tuo nome

source: Your e-mail address
it: Il tuo indirizzo di email

source: Team e-mail address
it: Indirizzo email del gruppo

source: Charset
it: Set di caratteri

source: With this form you can change the title of the message catalog. The title also is used as the value of the <tt>Project-Id-Version</tt> field in the header of the PO files, which are generated when the message catalog is exported.
it: Con questa maschera puoi modificare il titolo del catalogo dei messaggi. Il titolo viene usato anche come valore del campo <tt>Project-Id-Version</tt> nell'intestazione dei file PO, che sono generati quando si esporta il catalogo.

source: Besides the title the header of a PO file stores more information, the name and the email address of the last translator, the email adress of the translation team and the charset. The forms below let to modify this information for each language.
it: Oltre al titolo l'intestazione di un file PO memorizza altre informazioni, il nome e l'indirizzo dell'ultimo traduttore, l'indirizzo di email del gruppo di traduzione e il set di caratteri. Le maschere che seguono ti permettono di modificare queste informazioni per ogni lingua.

source: You can export the messages and their translations to TMX level 1 files. To do that just click the <tt>Export</tt> button.
it: Puoi esportare i messaggi e le loro traduzioni come file TMX level 1. Per farlo premi semplicemente il pulsante <tt>Esporta</tt>.

source: The message catalog also supports importing TMX files. You can add new messages and translations importing a TMX file in TMX level 1. Enter the filename and click the <tt>Import</tt> button.
it: Il catalogo dei messaggi permette anche di importare file TMX. Puoi aggiungere nuovi messaggi e traduzioni importando un file TMX nel livello TMX 1. Immetti il nome del file e premi il pulsante <tt>Importa</tt>.

source: label
it: etichetta

source: Attributes
it: Attributi

source: Local properties
it: Proprietà locali

source: Saved changes.
it: Cambiamenti salvati.

source: Messages
it: Messaggi

source: Properties
it: Proprietà

source: Import/Export
it: Importa/Esporta

source: Contents
it: Contenuti

source: Security
it: Sicurezza

source: Undo
it: Disfa

source: Find
it: Trova

source: Catalan
it: Catalano

source: German
it: Tedesco

source: Spanish
it: Spagnolo

source: Basque
it: Basco

source: French
it: Francese

source: Hungarian
it: Ungherese

source: Japanese
it: Giapponese
